tests/cases/weldLine/system/expectedPatterns
moldingFoam: filling
End
