tests/cases/weldLine/system/verifyScript
verify-weld-line.py
